vota_prato/app/views/qualificacoes/_form.html.erb

        <!-- <%= form.label :cliente_id %> -->
        <%= form.collection_select(:cliente_id, Cliente.order(:nome),
            :id, :nome, :prompt => true) %>
---
SELECT "clientes".* FROM "clientes" ORDER BY "clientes"."nome" ASC

        <!-- <%= form.label :restaurante_id %> -->
        <%= form.collection_select(:restaurante_id, Restaurante.order(:nome),
            :id, :nome, :prompt => true) %>
---
SELECT "restaurantes".* FROM "restaurantes" ORDER BY "restaurantes"."nome" ASC