vota_prato/app/controllers/comentarios_controller.rb

SELECT "comentarios".* FROM "comentarios"
---
  def index
    @comentarios = Comentario.all

INSERT INTO "comentarios" ("conteudo", "comentavel_id", "comentavel_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["conteudo", "Conteúdo 1"], ["comentavel_id", 2], ["comentavel_type", "Restaurante"], ["created_at", "2017-07-11 22:19:41.056685"], ["updated_at", "2017-07-11 22:19:41.056685"]]
---
  def create
    @comentario = Comentario.new(comentario_params)

    respond_to do |format|
      if @comentario.save

UPDATE "comentarios" SET "conteudo" = $1, "updated_at" = $2 WHERE "comentarios"."id" = $3  [["conteudo", "Comentário Restaurante 1"], ["updated_at", "2017-07-12 14:59:17.381936"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @comentario.update(comentario_params)

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comentarios" WHERE "comentarios"."id" = $1  [["id", 4]]
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_comentario
      @comentario = Comentario.find(params[:id])