vota_prato/app/controllers/restaurantes_controller.rb

SELECT  "restaurantes".* FROM "restaurantes" ORDER BY "restaurantes"."nome" ASC LIMIT $1  [["LIMIT", 11]]
SELECT COUNT(*) FROM "restaurantes"
SELECT  "restaurantes".* FROM "restaurantes" ORDER BY nome LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT  1 AS one FROM "restaurantes" WHERE "restaurantes"."nome" = $1 LIMIT $2  [["nome", "Restaurante 0"], ["LIMIT", 1]]
INSERT INTO "restaurantes" ("nome", "endereco", "created_at", "updated_at", "especialidade") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Restaurante 0"], ["endereco", "Rua 0 de setembro"], ["created_at", "2017-07-08 15:51:16.405888"], ["updated_at", "2017-07-08 15:51:16.405888"], ["especialidade", "vegetariano"]]
---
    def index
        @restaurantes = Restaurante.order("nome").page(params["page"]).per(10)

        # somente durante a faze de testes
        if @restaurantes.empty?
            especialidades = %w{massas japonês vegetariano}
            50.times do |i|
                Restaurante.create!(
                    nome: "Restaurante #{i}",
                    endereco: "Rua #{i} de setembro",
                    especialidade: especialidades.sample
                )

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @restaurante = Restaurante.find(params[:id])

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "restaurantes" WHERE "restaurantes"."id" = $1  [["id", 1]]
---
    def destroy
        @restaurante = Restaurante.find(params[:id])
        @restaurante.destroy

INSERT INTO "restaurantes" ("nome", "endereco", "created_at", "updated_at", "especialidade") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Restaurante Novo"], ["endereco", "Endereco Novo"], ["created_at", "2017-07-10 14:03:37.484195"], ["updated_at", "2017-07-10 14:03:37.484195"], ["especialidade", "Especialidade Nova"]]
---
    def create
        @restaurante = Restaurante.new(restaurante_params)
        if @restaurante.save

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
---
    def edit
        @restaurante = Restaurante.find params[:id]

SELECT  "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
UPDATE "restaurantes" SET "nome" = $1, "updated_at" = $2 WHERE "restaurantes"."id" = $3  [["nome", "Restaurante Italiano"], ["updated_at", "2017-07-10 14:32:33.528263"], ["id", 49]]
---
    def update
        @restaurante = Restaurante.find(params[:id])

        if @restaurante.update_attributes(restaurante_params)