vota_prato/app/views/restaurantes/show.html.erb

<b>Nota média: </b>
    <%= @restaurante.qualificacoes.average(:nota) %><br/>
<b>Qualificações: </b>
    <%= @restaurante.qualificacoes.count %><br/>
<b>Preço médio:</b>
    <%= @restaurante.qualificacoes.average(:valor_gasto) %>
---
SELECT AVG("qualificacoes"."nota") FROM "qualificacoes" WHERE "qualificacoes"."restaurante_id" = $1  [["restaurante_id", 2]]
SELECT COUNT(*) FROM "qualificacoes" WHERE "qualificacoes"."restaurante_id" = $1  [["restaurante_id", 2]]
SELECT AVG("qualificacoes"."valor_gasto") FROM "qualificacoes" WHERE "qualificacoes"."restaurante_id" = $1  [["restaurante_id", 2]]